#+title: Strings
#+STARTUP:overview hideblocks indent
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:C :main yes :includes <stdio.h> <stdlib.h> <string.h> <time.h> :results output :exports both :comments none :noweb yes

* First examples

- Structure example: A point is defined as a pair of (x,y)
  values. Once the =struct= is defined, =Point= can be used like any other
  data type.
  #+begin_src C
    // Declare Point structure

    // Main program
  #+end_src

- Enumeration example: The =enum= =Day= is an integer type whose values
  are named.
  #+begin_src C
    enum Day { MON, TUE, WED, THU, FRI, SAT, SUN };

    int main() {
      enum Day today = WED;
      printf("Today is day number: %d\n", today); // Output: 2 (WED)
      return 0;
    }
  #+end_src

  #+RESULTS:
  : Today is day number: 2

- Union example: Similar to a structure except that its members share
  the same storage so that only one member can be stored at a time.
  #+begin_src C
    // declare data Union

    // Main program
    int main() {
      // Define data as Data

      // Assign data values

      // Print data values
      n
      return 0;
    }
  #+end_src

